Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Produce a `ServiceStartBuildItem` to indicate the startup of a service. See <<startup-shutdown-events>> for details.
ja_jp: サービスの起動を示す `ServiceStartBuildItem` を生成します。詳しくは <<startup-shutdown-events>> を参照します。

source: Produce an `AdditionalBeanBuildItem`
ja_jp: `AdditionalBeanBuildItem` を生産

source: Produce or return a `JsonRPCProvidersBuildItem`
ja_jp: `JsonRPCProvidersBuildItem` を生成または返します。

source: Produce the runtime instance through a proxy returned from a <<writing-extensions.adoc#bytecode-recording,`@Recorder` method>> and set it via `ExtendedBeanConfigurator#runtimeValue(RuntimeValue<?>)` or `ExtendedBeanConfigurator#supplier(Supplier<?>)`.
ja_jp: <<writing-extensions.adoc#bytecode-recording,`@Recorder` メソッド>> から返されたプロキシー経由でランタイムインスタンスを生成し、それを `ExtendedBeanConfigurator#runtimeValue(RuntimeValue<?>)` または `ExtendedBeanConfigurator#supplier(Supplier<?>)` 経由で設定します。

source: Produce the runtime instance through a proxy returned from a <<writing-extensions.adoc#bytecode-recording,`@Recorder` method>> and set it via `ExtendedBeanConfigurator#runtimeValue(RuntimeValue<?>)`, `ExtendedBeanConfigurator#runtimeProxy(Object)`, `ExtendedBeanConfigurator#supplier(Supplier<?>)` or `ExtendedBeanConfigurator#createWith(Function<SyntheticCreationalContext<?>, <?>)`.
ja_jp: <<writing-extensions.adoc#bytecode-recording,`@Recorder` method>> から返されたプロキシー経由でランタイムインスタンスを生成し、それを `ExtendedBeanConfigurator#runtimeValue(RuntimeValue<?>)`、 `ExtendedBeanConfigurator#runtimeProxy(Object)`、 `ExtendedBeanConfigurator#supplier(Supplier<?>)` または `ExtendedBeanConfigurator#createWith(Function<SyntheticCreationalContext<?>, <?>)` を介して設定します。

source: Producer Batching
ja_jp: プロデューサーのバッチ処理

source: Producer fields
ja_jp: プロデューサーフィールド

source: Producer method interception and synthetic bean interception only works for instance methods. <<interception_of_static_methods>> is not supported for producer methods and synthetic beans.
ja_jp: プロデューサーメソッドインターセプションと合成 Bean インターセプションは、インスタンスメソッドに対してのみ機能します。 <<interception_of_static_methods>> はプロデューサーメソッドと合成 Bean ではサポートされていません。

source: Producer methods
ja_jp: プロデューサーメソッド

source: Producer methods and fields are useful if you need additional control over instantiation of a bean. They are also useful when integrating third-party libraries where you don't control the class source and may not add additional annotations etc.
ja_jp: プロデューサ・メソッドとフィールドは、Beanのインスタンス化を追加で制御する必要がある場合に便利です。また、サードパーティのライブラリを統合する際に、クラスソースを制御できず、追加のアノテーションなどを追加できない場合にも便利です。

source: Producer methods and fields, disposers
ja_jp: producer のメソッドおよびフィールド、ディスポーザー

source: Producer name
ja_jp: プロデューサー名

source: Producer should take action when encryption fails. + * **FAIL**: if encryption fails, unencrypted messages fail to send. + * **SEND**: if encryption fails, unencrypted messages are sent.
ja_jp: 暗号化に失敗した場合、プロデューサはアクションを起こす必要があります。+ * *FAIL* : 暗号化に失敗した場合、暗号化されていないメッセージは送信されませ ん。+ * *SEND* : 暗号化に失敗した場合、暗号化されていないメッセージが送信されます。

source: Producers Example
ja_jp: プロデューサーの例

source: Producers publish messages to _topics_.
ja_jp: プロデューサーは _トピック_ にメッセージを公開します。

source: Produces `helloworld!`
ja_jp: `helloworld!` の生成

source: Produces a final container image (with an `-aot` suffix in its version) that includes the AOT cache and is pre-configured to use it at startup.
ja_jp: AOT キャッシュを含み、起動時にそれを使用するように事前設定された最終的なコンテナーイメージ (バージョンに `-aot` サフィックスが付加されます) を生成します。

source: Produces: `Hello 1, you are running on context: io.vertx.core.impl.DuplicatedContext@5dc42d4f and on thread Thread[vert.x-eventloop-thread-1,5,main]` - so invoked on an event loop.
ja_jp: 生成: `Hello 1, you are running on context: io.vertx.core.impl.DuplicatedContext@5dc42d4f and on thread Thread[vert.x-eventloop-thread-1,5,main]` - イベントループで呼び出されます。

source: Produces: `Hello 2, you are running on context: io.vertx.core.impl.DuplicatedContext@41781ccb and on thread Thread[executor-thread-1,5,main]` - so invoked on a worker thread.
ja_jp: 生成: `Hello 2, you are running on context: io.vertx.core.impl.DuplicatedContext@41781ccb and on thread Thread[executor-thread-1,5,main]` - ワーカースレッドで呼び出されます。

source: Producing a SPI service implementation as a resource in META-INF/services
ja_jp: META-INF/services のリソースとして SPI サービス実装を作成します。

source: Producing a native executable
ja_jp: ネイティブ実行可能ファイルの生成

source: Producing a native executable can lead to a few issues, and so it's also a good idea to run some tests against the application running in the native file.
ja_jp: ネイティブ実行可能ファイルを生成することはいくつかの問題を引き起こす可能性があるので、ネイティブファイルで実行されているアプリケーションに対していくつかのテストを実行するのも良いアイデアです。

source: Producing a native executable can lead to a few issues, and so it's also a good idea to run some tests against the application running in the native file. The reasoning is explained in the link:getting-started-testing#quarkus-integration-test[Testing Guide].
ja_jp: ネイティブ実行可能ファイルを生成することはいくつかの問題を引き起こす可能性があるので、ネイティブファイルで実行されているアプリケーションに対していくつかのテストを実行することをお勧めします。その理由は link:getting-started-testing#quarkus-integration-test[テストのガイド] で説明されています。

source: Producing a static resource (e.g., JavaScript file) served by Vertx
ja_jp: Vertx が提供する静的リソース (例: JavaScript ファイル) を生成します。

source: Producing values
ja_jp: 値の生成

source: Production databases need to be configured as normal, so if you want to include a production database config in your `application.properties` and continue to use Dev Services we recommend that you use the `%prod.` profile to define your database settings.
ja_jp: 本番データベースは通常どおりに設定する必要があります。そのため、本番データベース設定を `application.properties` に含め、引き続き Dev Services を使用する場合は、 `%prod.` プロファイルを使用してデータベース設定を定義することをお勧めします。

source: Production databases need to be configured as normal, so if you want to include a production database config in your application.properties and continue to use Dev Services we recommend that you use the `%prod.` profile to define your database settings.
ja_jp: 本番環境のデータベースは通常通り構成する必要があります。そのため、本番環境のデータベースの構成をapplication.propertiesに含めてDevServicesを継続して使用したい場合は、 `%prod.` プロファイルを使用してデータベースの設定を定義することをお勧めします。

source: Production mode
ja_jp: 本番モード

source: Production ready: The same CEL library used by Go operators, now available in Java
ja_jp: 本番環境への対応: Go オペレーターで使用されているものと同じ CEL ライブラリーが、Java でも利用可能になります。

source: Profile Runtime Behaviour
ja_jp: 実行時動作のプロファイリング

source: Profile aware files
ja_jp: プロファイル対応ファイル

source: Profile in the property name
ja_jp: プロパティー名のプロファイル

source: Profile-aware files
ja_jp: プロファイル対応ファイル

source: Profiles
ja_jp: プロファイル

source: Profiles in the `.env` file follow the syntax `_{PROFILE}_CONFIG_KEY=value`:
ja_jp: `.env` ファイルのプロファイルは構文 `_{PROFILE}_CONFIG_KEY=value` に従います。

source: Profiling
ja_jp: プロファイリング

source: Programmatic API for caching
ja_jp: キャッシングのためのプログラマティックなAPI

source: Programmatic Approach
ja_jp: プログラムアプローチ

source: Programmatic OIDC start-up
ja_jp: プログラムによる OIDC のスタートアップ

source: Programmatic OIDC start-up for multiple tenants
ja_jp: 複数のテナント向けのプログラムによる OIDC の起動

source: Programmatic Redis Hosts
ja_jp: プログラマティックRedisホスト

source: Programmatic Scheduling
ja_jp: プログラムスケジューリング

source: Programmatic Scheduling with Quartz API
ja_jp: Quartz APIを使用したプログラマティックスケジューリング

source: Programmatic approach
ja_jp: プログラム的アプローチ

source: Programmatic client creation with QuarkusRestClientBuilder
ja_jp: QuarkusRestClientBuilderを使用したプログラムによるクライアントの作成

source: Programmatic client creation with RestClientBuilder
ja_jp: RestClientBuilder を使用したプログラムによるクライアントの作成

source: Programmatic lookup via `javax.enterprise.inject.Instance`
ja_jp: `javax.Enterprise.inject.instance` を介したプログラムによる検索

source: Programmatic mapping
ja_jp: プログラムによるマッピング

source: Programmatic set up references
ja_jp: プログラムによる設定のリファレンス

source: Programmatically Configuring Elasticsearch
ja_jp: Elasticsearchのプログラムによる設定

source: Programmatically Resolving Tenants Configuration
ja_jp: テナントの設定をプログラムで解決

source: Programmatically Resolving Tenants Connections
ja_jp: テナント接続をプログラムで解決

source: Programmatically access
ja_jp: プログラムでアクセス

source: Programmatically access the configuration
ja_jp: 設定にプログラムでアクセス

source: Programmatically access to the web links registry
ja_jp: Web リンクレジストリーへのプログラムによるアクセス

source: Programmatically begin a transaction.
ja_jp: プログラムでトランザクションを開始します。

source: Programmatically creating the Multipart form
ja_jp: プログラムによるマルチパートフォームの作成

source: Programmatically decide to abort the transaction which means that the changes made by the flight and taxi services are discarded.
ja_jp: プログラム的には、フライトやタクシーサービスによって行われた変更が破棄されることを意味するトランザクションの中止を決定します。

source: Programmatically decide to set the transaction for rollback.
ja_jp: プログラムにより、トランザクションをロールバックするように設定します。

source: Programmatically declared extensions are always instantiated later in the test lifecycle, hence circumventing the issue.
ja_jp: プログラムで宣言されたエクステンションは、テストライフサイクルの後半で常にインスタンス化されるため、この問題を回避できます。

source: Programming model
ja_jp: プログラミングモデル

source: Project Homepage
ja_jp: プロジェクトホームページ

source: Project Leyden addresses the same fundamental problem as GraalVM native image, but takes a different approach:
ja_jp: Project Leyden は GraalVM ネイティブイメージと同じ根本的な問題に対処しますが、異なるアプローチを取っています。

source: Project Leyden brings Ahead-of-Time (AOT) compilation to the JVM. By recording class loading, class linking, and method profiling during a training run, you can generate an AOT cache file that the JVM can use for subsequent runs.
ja_jp: Project Leyden は、Ahead-of-Time (AOT) コンパイルを JVM にもたらします。トレーニング実行中にクラスロード、クラスリンク、およびメソッドプロファイリングを記録することで、JVM が後続の実行に使用できる AOT キャッシュファイルを生成できます。

source: Project Leyden in Quarkus
ja_jp: Quarkus における Project Leyden

source: Project Leyden integration
ja_jp: Project Leyden の統合

source: Project Leyden is actively evolving, and we are closely tracking its developments, in particular via the premain branch of the OpenJDK Leyden repository, where experimental features are developed before being integrated into mainline JDK releases.
ja_jp: Project Leyden は積極的に進化しており、私たちはその開発を密接に追跡しています。特に OpenJDK Leyden リポジトリの `premain` ブランチを通じて、実験的な機能が主流の JDK リリースに統合される前に開発されています。

source: Project Leyden is available starting with OpenJDK 25 (counting only LTS releases). We'll explore it in detail in a dedicated blog post very soon.
ja_jp: Project Leyden は OpenJDK 25 (LTS リリースのみをカウント) から利用可能です。近日中に専用のブログ記事で詳細を説明します。

source: Project Leyden is being continuously improved and is likely to figure prominently in the future of the Java platform. As part of our quest in Quarkus to provide the best development platform, with the help of the OpenJDK team at IBM, we are actively monitoring the progress made upstream (in the `premain` branch of https://github.com/openjdk/leyden/tree/premain[`git@github.com:openjdk/leyden.git`]) and plan to continue shaping the Quarkus + Leyden experience accordingly.
ja_jp: Project Leyden は継続的に改善されており、Java プラットフォームの将来において重要な位置を占める可能性が高いです。最高の開発プラットフォームを提供するという Quarkus の探求の一環として、IBM の OpenJDK チームの協力を得て、私たちはアップストリーム（ https://github.com/openjdk/leyden/tree/premain[`git@github.com:openjdk/leyden.git`] の `premain` ブランチ）での進捗状況を積極的に監視しており、Quarkus と Leyden のエクスペリエンスをそれに応じて形成し続ける予定です。

source: Project Leyden is still evolving, and we look forward to seeing what they are preparing for Java 27 and beyond.
ja_jp: Project Leyden はまだ進化途上にあり、Java 27 以降に向けてどのような準備をしているのか楽しみにしています。

source: Project Leyden reduces startup time by optimizing class loading and linking. It reduces warmup time by providing the JVM with profiling information, and will reduce it even further once compiled code itself is stored in the cache.
ja_jp: Project Leyden は、クラスのロードとリンクを最適化することで起動時間を短縮します。JVM にプロファイリング情報を提供することでウォームアップ時間を短縮し、コンパイルされたコード自体がキャッシュに保存されるようになれば、さらに短縮されるでしょう。

source: Project Leyden status
ja_jp: Project Leyden のステータス

source: Project Leyden takes a conservative approach: it only caches classes loaded by the standard JDK class loaders. In other words, no custom class loaders are allowed if you want to fully benefit from AOT caching.
ja_jp: Project Leyden は保守的なアプローチをとっており、標準の JDK クラスローダーによってロードされたクラスのみをキャッシュします。つまり、AOT キャッシュを最大限に活用したい場合は、カスタムクラスローダーは許可されません。

source: Project Leyden's approach to AOT
ja_jp: Project Leyden の AOT へのアプローチ

source: Project Loom is coming to the JDK soon and proposes a virtual thread-based model. The Quarkus architecture is ready to support Loom as soon as it's become globally available.
ja_jp: JDKに近々導入されるProject Loomは、仮想スレッドベースのモデルを提案しています。Quarkusのアーキテクチャは、Loomがグローバルに利用可能になり次第、サポートする準備ができています。

source: Project setup
ja_jp: プロジェクトのセットアップ

source: Projection can be done for both PanacheQL and native queries.
ja_jp: 射影は、PanacheQLとネイティブクエリの両方で行うことができます。

source: Projects in WSL2 are now supported.
ja_jp: WSL2のプロジェクトがサポートされました。

source: Proof Of Key for Code Exchange (PKCE)
ja_jp: コード交換 (PKCE) のキーの証明

source: Propagate `maven.home` system property set by the Maven CLI to the tests
ja_jp: Maven CLI によって設定された `maven.home` システムプロパティーをテストに伝達します。

source: Propagate access token as an HTTP `Authorization: Bearer accesstoken` header
ja_jp: アクセストークンを HTTP `Authorization: Bearer accesstoken` ヘッダーとして伝播します。

source: Propagate access tokens to microservices
ja_jp: アクセストークンをマイクロサービスに伝播する

source: Propagate incoming record key to the outgoing record Type: _boolean_
ja_jp: 受信レコードのキーを送信レコードに伝搬させるかどうか Type: _boolean_

source: Propagate the `SecurityIdentity` when a Vert.x route handler is registered programmatically on the Vert.x HTTP router. It is required because Quarkus cannot detect that the `SecurityIdentity` injection point is used in the programmatically registered Vert.x route handler. For the routes registered declaratively with the `@Route` annotation as well as Jakarta REST endpoints, this configuration is not required.
ja_jp: Vert.x HTTP ルーターに Vert.x ルートハンドラーがプログラムによって登録されるときに、`SecurityIdentity` を伝播します。これは、Quarkus がプログラムによって登録された Vert.x ルートハンドラーで `SecurityIdentity` のインジェクションポイントが使用されていることを検出できないためです。`@Route` アノテーションで宣言的に登録されたルートや Jakarta REST エンドポイントの場合、この設定は必要ありません。

source: Propagating Record Key
ja_jp: レコードキーの伝播

source: Propagating tokens to downstream services
ja_jp: 下流サービスへのトークンの伝播

source: Propagators
ja_jp: プロパゲーター

source: Proper explanation of why the bean is inactive. Another inactive `ActiveResult` may also be provided as a cause, if this bean's inactivity stems from another bean's inactivity.
ja_jp: Bean が非アクティブである理由の適切な説明。 この Bean の非アクティブが別の Bean の非アクティブに起因する場合、別の非アクティブな `ActiveResult` も原因として提供されることがあります。

source: Properties Files Realm Configuration
ja_jp: プロパティーファイルレルム設定

source: Properties can be added. Use `_` in front of a property if that property is private. Properties are usually injected in the HTML template, and can be defined as having state, meaning that if that property changes, the component (or part of it) should re-render. In this case, the jokes are Build time data that we gathered while building.
ja_jp: プロパティーを追加できます。そのプロパティーがプライベートである場合は、プロパティーの前に `_` を使用します。プロパティーは通常 HTML テンプレートに注入され、状態を持つものとして定義できます。つまり、そのプロパティーが変更された場合、コンポーネント (またはその一部) は再レンダリングされるべきです。この場合、ジョークはビルド時に収集したビルド時データです。

source: Properties can be added. Use `_` in front of a property if that property is private. Properties are usually injected in the HTML template, and can be defined as having state, meaning that if that property changes, the component should re-render. In this case, the beans are Build time data and only change on hot-reload, which will be covered later.
ja_jp: プロパティを追加することができます。プロパティがプライベートである場合は、プロパティの前に `_` を使用します。プロパティは通常HTMLテンプレートに注入され、そのプロパティが変更された場合、コンポーネントを再レンダリングすることを意味する状態を持つように定義できます。この場合、ビーンズはビルド時間データであり、ホットリロード時にのみ変更されます。

source: Properties in the profile aware file have priority over profile aware properties defined in the main file.
ja_jp: プロファイル対応ファイルのプロパティーは、メインファイルで定義されているプロファイル対応プロパティーよりも優先されます。

source: Properties in the profile-aware file have priority over profile-aware properties defined in the main file.
ja_jp: プロファイル対応ファイル内のプロパティーは、メインファイルで定義されているプロファイル対応プロパティーよりも優先されます。

source: Properties referring to config group arrays (e.g. `kubernetes.labels[0]`, `kubernetes.env-vars[0]` etc) have been converted to Maps to align with the rest of the Quarkus ecosystem.
ja_jp: 設定グループ配列を参照するプロパティー (例: `kubernetes.labels0`、 `kubernetes.env-vars0` など) は、Quarkus エコシステムの残りの部分に合わせてマップに変換されました。

source: Properties referring to config group arrays (e.g. `kubernetes.labels[0]`, `kubernetes.env-vars[0]` etc) have been converted to maps, to align with the rest of the Quarkus ecosystem.
ja_jp: コンフィググループ配列を参照するプロパティー(例: `kubernetes.labels[0]` 、 `kubernetes.env-vars[0]` など)は、Quarkusのエコシステムの他の部分と一致するようにマップに変換されました。

source: Properties referring to config group arrays (e.g. `kubernetes.labels[0]`, etc.) have been converted to Maps to align with the rest of the Quarkus ecosystem.
ja_jp: 設定グループ配列を参照するプロパティー (例: `kubernetes.labels[0]` など) は、Quarkus エコシステムの他の部分と整合するように Map に変換されました。

source: Properties set at runtime have absolutely no effect on the bean resolution using `@IfBuildProperty` / `@UnlessBuildProperty`.
ja_jp: 実行時に設定されたプロパティーは、`@IfBuildProperty` / `@UnlessBuildProperty` を使用した Bean 解決には全く影響しません。

source: Properties set at runtime have absolutely no effect on the bean resolution using `@IfBuildProperty`.
ja_jp: 実行時に設定されたプロパティーは、 `@IfBuildProperty` を使用しても Bean の解決に全く影響しません。

source: Properties that use non-standard types, can be referenced by expanding the property. For example to define a `kubernetes-readiness-probe` which is of type `Probe`:
ja_jp: 非標準型を使用するプロパティーは、プロパティーを展開することで参照することができます。例えば、 `Probe` 型の `kubernetes-readiness-probe` を定義するには次のようにします。

source: Properties with default values can be configured in a configuration file just like any other property. However, the default value will be used if the property was not defined in a configuration file.
ja_jp: デフォルト値を持つプロパティは、他のプロパティと同様に設定ファイルで設定できます。ただし、そのプロパティが設定ファイルで定義されていない場合は、デフォルト値が使用されます。

source: Properties with optional values are the middle-ground between standard and properties with default values. While a missing property in a configuration file will not cause your application to fail, it will nevertheless not have a value set. We use `java.util.Optional` type to define such properties.
ja_jp: オプション値を持つプロパティは、標準的なプロパティとデフォルト値を持つプロパティの中間的な存在です。設定ファイルにプロパティがないからといって、アプリケーションが失敗することはありませんが、それにもかかわらず、値が設定されていないことがあります。このようなプロパティの定義には `java.util.Optional` タイプを使用します。

source: Properties without the quarkus prefix
ja_jp: quarkus 接頭辞のないプロパティー

source: Property
ja_jp: プロパティー

source: Property Accessor Examples
ja_jp: プロパティーアクセサーの例

source: Property Expressions
ja_jp: プロパティー式

source: Property Expressions allow you to define a default value that is used, if the property is not configured.
ja_jp: プロパティ式では、そのプロパティが構成されていない場合に使用されるデフォルト値を定義することができます。

source: Property Expressions also work with Environment Variables.
ja_jp: プロパティー式は環境変数でも機能します。

source: Property Name
ja_jp: プロパティ名

source: Property expression `all-roles` will be treated as a collection type `List`, therefore, the endpoint will be accessible for roles `Administrator`, `Software`, `Tester` and `User`.
ja_jp: プロパティー式 `all-roles` は、コレクション型 `List` として扱われます。そのため、このエンドポイントには、 `Administrator`、 `Software`、 `Tester` および `User` の各ロールがアクセスできるようになります。

source: Property name
ja_jp: プロパティ名

source: Property value
ja_jp: プロパティ値

source: Property values can be any primitive type except `char`. It can also be `String`, and `OffsetDateTime`. `OffsetDateTime` query param values must be in ISO-8601 format.
ja_jp: プロパティーの値は、 `char` 以外の任意のプリミティブ型にすることができます。また、 `String` や `OffsetDateTime` も可能です。 `OffsetDateTime` クエリのパラメーター値は ISO-8601 形式でなければなりません。

source: Proprietary Databases - License Acceptance
ja_jp: 独自のデータベース - ライセンスの受諾

source: Pros
ja_jp: 長所

source: Protect Quarkus web application by using an Auth0 OpenID Connect provider
ja_jp: Auth0 OpenID Connectプロバイダーを使用したQuarkus Webアプリケーションの保護

source: Protect a Quarkus web application by using an Auth0 OpenID Connect provider
ja_jp: Auth0 OpenID Connectプロバイダーを使用したQuarkus Webアプリケーションの保護

source: Protect a service application by using OpenID Connect (OIDC) Bearer token authentication
ja_jp: OpenID Connect（OIDC）ベアラートークン認証によるサービスアプリケーションの保護

source: Protect a web application by using OpenID Connect (OIDC) authorization code flow
ja_jp: Quarkus - 認可コードフローのOpenID Connectを使用してWebアプリケーションを保護

source: Protect the KeyStore password
ja_jp: KeyStoreパスワードの保護

source: Protected Resource Metadata
ja_jp: 保護されたリソースのメタデータ

source: Proto File + You can put the `.proto` file in the `META-INF` directory of the project. These files will automatically be picked up at initialization time.
ja_jp: Proto ファイル + プロジェクトの `META-INF` ディレクトリに `.proto` ファイルを置くことができます。これらのファイルは初期化時に自動的にピックアップされます。

source: Proto files for imports
ja_jp: インポート用の Proto ファイル

source: Proto files from dependencies
ja_jp: 依存関係の Proto ファイル

source: Protobuf does not inherently know how to marshal `java.time.LocalDate`. Fortunately, Protostream provides a straightforward solution to this problem using `@ProtoAdapter` and `@ProtoSchema`.
ja_jp: Protobuf は、 `java.time.LocalDate` をマーシャリングする方法を本来は認識していません。幸いなことに、Protostream は `@ProtoAdapter` と `@ProtoSchema` を使用して、この問題に対する簡単な解決策を提供します。

source: Protobuf schema
ja_jp: Protobuf スキーマ

source: Protocol Buffers do not contain descriptions of their own types. Thus, given only a raw message without the corresponding .proto file defining its type, it is difficult to extract any useful data. However, the contents of a .proto file can itself be https://protobuf.dev/programming-guides/techniques/#self-description[represented using protocol buffers].
ja_jp: Protocol Buffers には、独自の型の説明は含まれていません。したがって、型が定義された対応する .proto ファイルがない raw メッセージのみが指定された場合、有用なデータを抽出することは困難です。ただし、.proto ファイルの内容自体は、 https://protobuf.dev/programming-guides/techniques/#self-description[プロトコルバッファーを使用して表現] できます。

source: Protocol Buffers specification provides a way to import `proto` files. The Quarkus code generation mechanism lets you control the scope of dependencies to scan for possible imports by setting the `quarkus.generate-code.grpc.scan-for-imports` property to one of the following:
ja_jp: Protocol Buffers仕様では、 `proto` ファイルをインポートする方法を提供しています。Quarkusのコード生成メカニズムでは、 `quarkus.generate-code.grpc.scan-for-imports` プロパティーを以下のいずれかに設定することで、インポートの可能性をスキャンするための依存関係の範囲を制御することができます。

source: Protocol Updates
ja_jp: プロトコルのアップデート

source: Protocol of proxy service. proxyServiceUrl and proxyProtocol must be mutually inclusive.
ja_jp: プロキシサービスのプロトコル。proxyServiceUrl と proxyProtocol は相互に含める必要があります。

source: Protocols of TLS.
ja_jp: TLSのプロトコル。

source: Protostream provides default Protobuf mappers for commonly used types as `BigDecimal`, included in the `org.infinispan.protostream.types` package.
ja_jp: Protostreamは、 `BigDecimal` のように、一般的に使用される型に対するデフォルトの Protobuf マッパーを提供します。これらは `org.infinispan.protostream.types` パッケージに含まれます。

source: Proven Java for the Cloud
ja_jp: クラウド向けの実証済み Java

source: Proven at Scale:
ja_jp: 大規模で実証済み:

source: Provide a *user message* as the primary prompt.
ja_jp: プライマリプロンプトとして *ユーザーメッセージ* を提供します。

source: Provide a Summary section
ja_jp: 概要セクションの提供

source: Provide a class defining your expected response structure.
ja_jp: 期待されるレスポンス構造を定義するクラスを提供します。

source: Provide a description for the counter
ja_jp: カウンターの説明を入力してください

source: Provide a description for the distribution summary
ja_jp: ディストリビューションサマリーの説明を入力します

source: Provide a description of the Gauge
ja_jp: ゲージの説明を入力してください

source: Provide a direct hyperlink to the section, using the `xref` guidance in the previous section.
ja_jp: 前のセクションの `xref` ガイダンスを使用して、セクションへの直接ハイパーリンクを提供します。

source: Provide an `Alternative` CDI bean implementation, like the example below:
ja_jp: 以下の例のように、 `Alternative` CDI Bean 実装を提供します。

source: Provide an index name to be used for the `SomeIndexedEntity` entity.
ja_jp: `SomeIndexedEntity` エンティティーに使用するインデックス名を指定します。

source: Provide an optional *system message* to guide the assistant's behavior.
ja_jp: アシスタントの動作をガイドするために、オプションの *システムメッセージ* を提供します。
